backend/app/Repositories/PostRepository.php

select * from `posts`
---
    public function index()
    {
        return $this->post->all();

insert into `posts` (`title`, `comment`, `user_id`, `updated_at`, `created_at`) values ('test', 'test comment', '2', '2021-03-20 01:43:35', '2021-03-20 01:43:35')
---
    public function store(array $post_info)
    {
        $post = new Post();
        $post->fill($post_info)->save();

update `posts` set `comment` = 'edit', `posts`.`updated_at` = '2021-03-20 01:44:23' where `id` = 3
---
    public function update(array $post, int $postId)
    {
        try {
            DB::beginTransaction();

            $post_info = $this->post->find($postId);
            $post_info->fill($post)->save();

delete from `posts` where `id` = 2
---
    public function delete(int $id)
    {
        return $this->post->find($id)->delete();