backend/app/Repositories/UserRepository.php

select * from `users`
---
    public function index()
    {
        return $this->user->all();

insert into `users` (`name`, `updated_at`, `created_at`) values ('ditds', '2021-03-19 11:17:35', '2021-03-19 11:17:35')
---
    public function store(array $user_info)
    {
        $user = new User();
        $user->fill($user_info)->save();

update `users` set `name` = 'edit', `users`.`updated_at` = '2021-03-19 11:20:47' where `id` = 1
---
    public function update(array $user, int $userId)
    {
        try {
            DB::beginTransaction();

            $user_info = $this->user->find($userId);
            $user_info->fill($user)->save();

delete from `users` where `id` = 1
---
    public function delete(int $id)
    {
        return $this->user->find($id)->delete();